pkg/wsmantesting/responses/amt/ethernetport/put.xml

<?xml version= "1.0" encoding= "UTF-8"?>
<a:Envelope xmlns:a= "http://www.w3.org/2003/05/soap-envelope" xmlns:b= "http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:c= "http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:d= "http://schemas.xmlsoap.org/ws/2005/02/trust" xmlns:e= "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:f= "http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:g= "http://intel.com/wbem/wscim/1/amt-schema/1/AMT_EthernetPortSettings"
    xmlns:xsi= "http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>20</b:RelatesTo>
        <b:Action a:mustUnderstand= "true">http://schemas.xmlsoap.org/ws/2004/09/transfer/PutResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-0000000002FE</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_EthernetPortSettings</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:AMT_EthernetPortSettings>
            <g:DHCPEnabled>true</g:DHCPEnabled>
            <g:DefaultGateway>192.168.6.1</g:DefaultGateway>
            <g:ElementName>Intel(r) AMT Ethernet Port Settings</g:ElementName>
            <g:IPAddress>192.168.6.120</g:IPAddress>
            <g:InstanceID>Intel(r) AMT Ethernet Port Settings 0</g:InstanceID>
            <g:IpSyncEnabled>true</g:IpSyncEnabled>
            <g:Link IsUp>true
            </g:LinkIsUp>
            <g:LinkPolicy>1</g:LinkPolicy>
            <g:LinkPolicy>14</g:LinkPolicy>
            <g:MACAddress>00-be-43-d8-22-a4</g:MACAddress>
            <g:PhysicalConnectionType>0</g:PhysicalConnectionType>
            <g:PrimaryDNS>192.168.6.1</g:PrimaryDNS>
            <g:SharedDynamicIP>true</g:SharedDynamicIP>
            <g:SharedMAC>true</g:SharedMAC>
            <g:SharedStaticIp>false</g:SharedStaticIp>
            <g:SubnetMask>255.255.255.0</g:SubnetMask>
        </g:AMT_EthernetPortSettings>
    </a:Body>
</a:Envelope>